test/request-response-samples/createData__should_generate_complex_type_request/request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://3e.pl/ADInterface">
   <soap:Body>
      <tns:createData>
         <tns:ModelCRUDRequest>
            <ModelCRUD>
               <serviceType>CreateInterest</serviceType>
               <TableName>WTC_EmployeeInterest</TableName>
               <RecordID>0</RecordID>
               <Filter></Filter>
               <Action>Create</Action>
               <DataRow>
                  <tns:field column="C_BPartner_ID">
                     <val>1001047</val>
                  </tns:field>
                  <tns:field column="Interest">
                     <val>Cooking</val>
                  </tns:field>
               </DataRow>
            </ModelCRUD>
            <ADLoginRequest>
               <user>WTCAdmin</user>
               <pass>WTCAdmin</pass>
               <lang>192</lang>
               <ClientID>11</ClientID>
               <RoleID>102</RoleID>
               <OrgID>1000001</OrgID>
               <WarehouseID>1000000</WarehouseID>
               <stage>0</stage>
            </ADLoginRequest>
         </tns:ModelCRUDRequest>
      </tns:createData>
   </soap:Body>
</soap:Envelope>
